# 1. Дан список чисел. Определите, сколько в нем встречается различных чисел.
# Примечание. Эту задачу на Питоне можно решить в одну строчку.

print(len(set(input().split())))
