#5. Написать программу, которая выводит в консоль таблицу Escape-последовательностей

print('Escape sequences')
print('\\a\t\tBell (alert)')
print('\\b\t\tBackspace')
print('\\n\t\tNew line')
print('\\t\t\tHorizontal tab')
print(r'\\','\t\tBackslash \\')
print('\\\"\t\tDouble quotation mark\"')
print("\\'\t\tSingle quotation mark \'")